# PEP8

# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать. Если
# в слово длинное, выводить только первые 10 букв в слове.

words = input('Введите текст\n')
list_words = words.split()
number = 1

for el in range(words.count(' ') + 1):
        print(f'{number} - {list_words [el] [0:10]}')
        number += 1
