# PEP8
# 6. * Реализовать структуру данных «Товары». Она должна представлять собой
# список кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже
# должно быть два элемента — номер товара и словарь с параметрами (характеристиками
# товара: название, цена, количество, единица измерения). Структуру нужно сформировать
# программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
# (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
# (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
# (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ —
# характеристика товара, например название, а значение — список значений-характеристик,
# например список названий товаров.
# Пример:
# {
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }

position = int(input('Введите количество позиций\n'))
n = 1
list_products = []
list_name = []
list_prise = []
list_quan = []
list_unit = []
analytics = {}

while n <= position:
    dict_products = {'Название': input('Введите название товара\n'), 'Цена': input('Введите цену за ед. товара\n'), 'Количество': input('Введите количество товара\n'), 'Ед.': input('Введите ед. изм. товара\n')}
    list_products.append((n, dict_products))
    list_keys = list(dict_products.keys())
    list_values = list(dict_products.values())
    list_name.append(list_values[0])
    list_prise.append(list_values[1])
    list_quan.append(list_values[2])
    list_unit.append(list_values[3])
    n += 1

list_products_sort = [list_name, list_prise, list_quan, list_unit]

for a, b in zip(list_keys, list_products_sort):
    analytics[a] = b

print(list_products)
print(analytics)



