# PEP8
# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор
# натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с
# тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

rating = [10, 7, 5, 3, 3, 2]

while True:
    number = input('Введите число\n')
    if number.isdigit():
        number = int(number)
        if number % 1 >= 0:
            break

for el in reversed(range(len(rating))):
    if rating[el] >= number:
        rating.insert(el + 1, number)
        break
if rating.count(number) == 0:
    rating.insert(0, number)

print(rating)


